import React from 'react';
import {Dimensions, ImageBackground} from 'react-native';
import Carousel from 'react-native-reanimated-carousel';
import {Box, Flex, Image, Text} from 'native-base';

const About = () => {
  const {width} = Dimensions.get('window');

  const data = [
    {
      id: '1',
      title: 'दवा वितरण :-',
      images: require('../Assests/About/a1.png'),
      h1: ' स्वर्गीय सुरेश सिंह फाउंडेशन ट्रस्ट द्वारा आयोजित स्वास्थ्य जांच के दौरान लोगों को डॉक्टर द्वारा लिखित दवाइयां उपलब्ध कराई जाती हैं। यह कार्य ट्रस्ट के मिशन का एक महत्वपूर्ण हिस्सा है।',
    },

    {
      id: '2',
      title: 'छात्र-छात्राओं की दौड़ स्पर्धा :-',
      images: require('../Assests/About/a2.png'),
      h1: 'ट्रस्ट प्रतिवर्ष 12 से 16 वर्ष आयु के छात्र-छात्राओं का दौड़ स्पर्धा आयोजित करता है। इसकी निगरानी ट्रस्ट के अनुरोध पर पटना एथलेटिक्स संघ द्वारा निष्पक्ष रूप से किया जाता है एवं गणमान्य अतिथियों की उपस्थिति में प्रथम दस छात्र-छात्राओं को प्रोत्साहन राशि, प्रमाण पत्र एवं पदक से सम्मानित किया जाता हैं। यह कार्यक्रम न केवल शारीरिक आरोग्य को बढ़ावा देता है बल्कि अनुशासन जैसे मूल्यवान जीवन कौशल भी सिखाता है।',
    },

    {
      id: '3',
      title: 'ग्रामीण महिला को आत्मनिर्भर बनाने हेतु सिलाई मशीन से सम्मानित',
      images: require('../Assests/About/a3.png'),
      h1: 'अति विशिष्ट कार्य को करने हेतु व्यावसायिक प्रशिक्षण आवश्यक है। यह आजीविका के लिए आवश्यक कौशल और ज्ञान से सशक्त बनाता है। निपुण ग्रामीण जरूरतमंद माताओं-बहनों को जीविकोपार्जन एवं स्वावलंबी बनाने हेतु ट्रस्ट द्वारा प्रोत्साहन स्वरूप सिलाई मशीनें भेंट कीं जाती है।',
    },

    {
      id: '4',
      title: 'किसान भाइयों के सशक्तिकरण हेतु तकनीकी यंत्र वितरण :-',
      images: require('../Assests/About/a4.png'),
      h1: ' किसान भाइयों की फसलें कीटों और बीमारियों से प्रभावित न हो, इसके लिए ट्रस्ट ने कीटनाशकों के छिड़काव हेतु बैटरी संचालित आधुनिक कृषि यंत्र वितरित किए हैं। इसके अलावा कृषि से जुड़ी कई जानकारियां भी दी गई हैं। इससे उनकी उपज में उल्लेखनीय वृद्धि दर्ज की गई है, जो समृद्ध समाज में अहम भूमिका निभा रही है।',
    },

    {
      id: '5',
      title: 'कम्बल एवं अंग वस्त्र वितरण :-',
      images: require('../Assests/About/a5.png'),
      h1: ' ठंड के कारण कठिनाइयों का सामना कर रहे जरूरतमंद लोगों की तत्काल जरूरतों को पूरा करने के लिए ट्रस्ट ने अपनी प्रतिबद्धता दिखाते हुए कंबल वितरित किए। इसी क्रम में ट्रस्ट ने जरूरतमंद महिलाओं को अंग वस्त्र वितरित किए।',
    },

    {
      id: '6',
      title: 'दिव्यांगजन (भाई-बहनों) को तिपहिया साइकिल :-',
      images: require('../Assests/About/a6.png'),
      h1: 'ग्रामीण क्षेत्रों में दिव्यांगजन (भाई-बहनों) के आवागमन में सुविधा हेतु ट्रस्ट ने उन्हें तिपहिया साइकिल प्रदान कीं, जिससे उनकी गतिशीलता में उल्लेखनीय सुधार हुआ है। ये तिपहिया साइकिल विभिन्न दिव्यांगजनों को ध्यान में रखकर बनाई गई हैं।',
    },

    {
      id: '7',
      title: 'वृक्षारोपण कार्यक्रम :-',
      images: require('../Assests/About/a7.png'),
      h1: 'धरती पर वृक्ष के बिना मनुष्य, पशु, पक्षी या किसी भी जीव-जंतु के जीवन की कल्पना नहीं की जा सकती। ट्रस्ट वृक्षों के महत्व और पर्यावरण संरक्षण के बारे में जागरूकता फैलाने हेतु वृक्षारोपण कार्यक्रम आयोजित करता है।',
    },
  ];

  const renderItem = ({item}) => (
    <Flex
      background={'#EFEFEF'}
      width={'100%'}
      height={'auto'}
      style={{gap: 10}}
      mt={4}>
      <Text
        color={'#F56A02'}
        fontSize={20}
        fontWeight={'bold'}
        width={'80%'}
        margin={'auto'}
        textAlign={'center'}>
        {item.title}
      </Text>
      <Image
        style={{resizeMode: 'cover', width: '100%'}}
        source={item.images}
      />
      <Flex width="90%" margin={'auto'} style={{gap: 10}} mt={-4}>
        <Text fontSize={16}>{item.h1}</Text>
        <Text fontSize={16}>{item.h2}</Text>
      </Flex>
    </Flex>
  );

  return (
    <>
      <Image
        source={require('../Assests/about_banner.png')}
        style={{
          width: '100%',
          height: 200,
          resizeMode: 'stretch',
          marginBottom: 10,
        }}
      />
      <Carousel
        loop
        width={width}
        height={800}
        autoPlay={true}
        data={data}
        scrollAnimationDuration={3000}
        renderItem={renderItem}
      />
    </>
  );
};

export default About;
