import {Flex, Image, Text} from 'native-base';
import {Dimensions} from 'react-native';
import Carousel from 'react-native-reanimated-carousel';

const Test = () => {
  const {width} = Dimensions.get('window');

  const data = [
    {
      id: '1',
      title: 'Gallery and Media',
      images: require('../Assests/About/a1.png'),
      h1: 'स्वर्गीय सुरेश सिंह फाउंडेशन  ट्रस्ट द्वारा आयोजित निःशुल्क स्वास्थ्य जांच शिविर सामुदायिक कल्याण और सशक्तिकरण का प्रतीक है।विशेषज्ञ डॉक्टरों की टीम के सहयोग से, शिविर में आने वाले जरूरतमंदों को चिकित्सा जांच एवं परामर्श प्रदान किया जाता है।इस कारण शिविर में बड़ी संख्या में लोग आते हैं, और विभिन्न सामाजिक-आर्थिक पृष्ठभूमि के लोग स्वास्थ्य सेवाओं का लाभ उठाते हैं।',
      h2: 'ट्रस्टस्वास्थ्य जांच पर ध्यान केंद्रित करके ग्रामीणों को बीमारियों से राहत दिलाने की पहल करता है क्योंकि बेहतर स्वास्थ्य के लिए जागरूकता और नियमित स्वास्थ्य जांच महत्वपूर्ण भूमिका निभाती है। यहाँ रक्तचाप की जाँच से लेकर मधुमेह की जाँच तक किया जाता है। स्वास्थ्य जांच में दाँतों एवं हड्डियों की जांच और उपचार किए जाते हैं। साथ ही ग्रामीण लोगों को बुनियादी चिकित्सा सुविधाएं और आवश्यक उपकरण प्रदान करके ट्रस्ट स्वस्थ गांव बनाने की पहल कर रहा है।',
    },

    {
      id: '2',
      title: 'Gallery and Media',
      images: require('../Assests/About/a2.png'),
      h1: 'स्वर्गीय सुरेश सिंह फाउंडेशन  ट्रस्ट द्वारा आयोजित निःशुल्क स्वास्थ्य जांच शिविर सामुदायिक कल्याण और सशक्तिकरण का प्रतीक है।विशेषज्ञ डॉक्टरों की टीम के सहयोग से, शिविर में आने वाले जरूरतमंदों को चिकित्सा जांच एवं परामर्श प्रदान किया जाता है।इस कारण शिविर में बड़ी संख्या में लोग आते हैं, और विभिन्न सामाजिक-आर्थिक पृष्ठभूमि के लोग स्वास्थ्य सेवाओं का लाभ उठाते हैं।',
      h2: 'ट्रस्टस्वास्थ्य जांच पर ध्यान केंद्रित करके ग्रामीणों को बीमारियों से राहत दिलाने की पहल करता है क्योंकि बेहतर स्वास्थ्य के लिए जागरूकता और नियमित स्वास्थ्य जांच महत्वपूर्ण भूमिका निभाती है। यहाँ रक्तचाप की जाँच से लेकर मधुमेह की जाँच तक किया जाता है। स्वास्थ्य जांच में दाँतों एवं हड्डियों की जांच और उपचार किए जाते हैं। साथ ही ग्रामीण लोगों को बुनियादी चिकित्सा सुविधाएं और आवश्यक उपकरण प्रदान करके ट्रस्ट स्वस्थ गांव बनाने की पहल कर रहा है।',
    },

    {
      id: '3',
      title: 'Gallery and Media',
      images: require('../Assests/About/a3.png'),
      h1: 'स्वर्गीय सुरेश सिंह फाउंडेशन  ट्रस्ट द्वारा आयोजित निःशुल्क स्वास्थ्य जांच शिविर सामुदायिक कल्याण और सशक्तिकरण का प्रतीक है।विशेषज्ञ डॉक्टरों की टीम के सहयोग से, शिविर में आने वाले जरूरतमंदों को चिकित्सा जांच एवं परामर्श प्रदान किया जाता है।इस कारण शिविर में बड़ी संख्या में लोग आते हैं, और विभिन्न सामाजिक-आर्थिक पृष्ठभूमि के लोग स्वास्थ्य सेवाओं का लाभ उठाते हैं।',
      h2: 'ट्रस्टस्वास्थ्य जांच पर ध्यान केंद्रित करके ग्रामीणों को बीमारियों से राहत दिलाने की पहल करता है क्योंकि बेहतर स्वास्थ्य के लिए जागरूकता और नियमित स्वास्थ्य जांच महत्वपूर्ण भूमिका निभाती है। यहाँ रक्तचाप की जाँच से लेकर मधुमेह की जाँच तक किया जाता है। स्वास्थ्य जांच में दाँतों एवं हड्डियों की जांच और उपचार किए जाते हैं। साथ ही ग्रामीण लोगों को बुनियादी चिकित्सा सुविधाएं और आवश्यक उपकरण प्रदान करके ट्रस्ट स्वस्थ गांव बनाने की पहल कर रहा है।',
    },

    {
      id: '4',
      title: 'Gallery and Media',
      images: require('../Assests/About/a4.png'),
      h1: 'स्वर्गीय सुरेश सिंह फाउंडेशन  ट्रस्ट द्वारा आयोजित निःशुल्क स्वास्थ्य जांच शिविर सामुदायिक कल्याण और सशक्तिकरण का प्रतीक है।विशेषज्ञ डॉक्टरों की टीम के सहयोग से, शिविर में आने वाले जरूरतमंदों को चिकित्सा जांच एवं परामर्श प्रदान किया जाता है।इस कारण शिविर में बड़ी संख्या में लोग आते हैं, और विभिन्न सामाजिक-आर्थिक पृष्ठभूमि के लोग स्वास्थ्य सेवाओं का लाभ उठाते हैं।',
      h2: 'ट्रस्टस्वास्थ्य जांच पर ध्यान केंद्रित करके ग्रामीणों को बीमारियों से राहत दिलाने की पहल करता है क्योंकि बेहतर स्वास्थ्य के लिए जागरूकता और नियमित स्वास्थ्य जांच महत्वपूर्ण भूमिका निभाती है। यहाँ रक्तचाप की जाँच से लेकर मधुमेह की जाँच तक किया जाता है। स्वास्थ्य जांच में दाँतों एवं हड्डियों की जांच और उपचार किए जाते हैं। साथ ही ग्रामीण लोगों को बुनियादी चिकित्सा सुविधाएं और आवश्यक उपकरण प्रदान करके ट्रस्ट स्वस्थ गांव बनाने की पहल कर रहा है।',
    },

    {
      id: '5',
      title: 'Gallery and Media',
      images: require('../Assests/About/a5.png'),
      h1: 'स्वर्गीय सुरेश सिंह फाउंडेशन  ट्रस्ट द्वारा आयोजित निःशुल्क स्वास्थ्य जांच शिविर सामुदायिक कल्याण और सशक्तिकरण का प्रतीक है।विशेषज्ञ डॉक्टरों की टीम के सहयोग से, शिविर में आने वाले जरूरतमंदों को चिकित्सा जांच एवं परामर्श प्रदान किया जाता है।इस कारण शिविर में बड़ी संख्या में लोग आते हैं, और विभिन्न सामाजिक-आर्थिक पृष्ठभूमि के लोग स्वास्थ्य सेवाओं का लाभ उठाते हैं।',
      h2: 'ट्रस्टस्वास्थ्य जांच पर ध्यान केंद्रित करके ग्रामीणों को बीमारियों से राहत दिलाने की पहल करता है क्योंकि बेहतर स्वास्थ्य के लिए जागरूकता और नियमित स्वास्थ्य जांच महत्वपूर्ण भूमिका निभाती है। यहाँ रक्तचाप की जाँच से लेकर मधुमेह की जाँच तक किया जाता है। स्वास्थ्य जांच में दाँतों एवं हड्डियों की जांच और उपचार किए जाते हैं। साथ ही ग्रामीण लोगों को बुनियादी चिकित्सा सुविधाएं और आवश्यक उपकरण प्रदान करके ट्रस्ट स्वस्थ गांव बनाने की पहल कर रहा है।',
    },

    {
      id: '6',
      title: 'Gallery and Media',
      images: require('../Assests/About/a6.png'),
      h1: 'स्वर्गीय सुरेश सिंह फाउंडेशन  ट्रस्ट द्वारा आयोजित निःशुल्क स्वास्थ्य जांच शिविर सामुदायिक कल्याण और सशक्तिकरण का प्रतीक है।विशेषज्ञ डॉक्टरों की टीम के सहयोग से, शिविर में आने वाले जरूरतमंदों को चिकित्सा जांच एवं परामर्श प्रदान किया जाता है।इस कारण शिविर में बड़ी संख्या में लोग आते हैं, और विभिन्न सामाजिक-आर्थिक पृष्ठभूमि के लोग स्वास्थ्य सेवाओं का लाभ उठाते हैं।',
      h2: 'ट्रस्टस्वास्थ्य जांच पर ध्यान केंद्रित करके ग्रामीणों को बीमारियों से राहत दिलाने की पहल करता है क्योंकि बेहतर स्वास्थ्य के लिए जागरूकता और नियमित स्वास्थ्य जांच महत्वपूर्ण भूमिका निभाती है। यहाँ रक्तचाप की जाँच से लेकर मधुमेह की जाँच तक किया जाता है। स्वास्थ्य जांच में दाँतों एवं हड्डियों की जांच और उपचार किए जाते हैं। साथ ही ग्रामीण लोगों को बुनियादी चिकित्सा सुविधाएं और आवश्यक उपकरण प्रदान करके ट्रस्ट स्वस्थ गांव बनाने की पहल कर रहा है।',
    },

    {
      id: '7',
      title: 'Gallery and Media',
      images: require('../Assests/About/a7.png'),
      h1: 'स्वर्गीय सुरेश सिंह फाउंडेशन  ट्रस्ट द्वारा आयोजित निःशुल्क स्वास्थ्य जांच शिविर सामुदायिक कल्याण और सशक्तिकरण का प्रतीक है।विशेषज्ञ डॉक्टरों की टीम के सहयोग से, शिविर में आने वाले जरूरतमंदों को चिकित्सा जांच एवं परामर्श प्रदान किया जाता है।इस कारण शिविर में बड़ी संख्या में लोग आते हैं, और विभिन्न सामाजिक-आर्थिक पृष्ठभूमि के लोग स्वास्थ्य सेवाओं का लाभ उठाते हैं।',
      h2: 'ट्रस्टस्वास्थ्य जांच पर ध्यान केंद्रित करके ग्रामीणों को बीमारियों से राहत दिलाने की पहल करता है क्योंकि बेहतर स्वास्थ्य के लिए जागरूकता और नियमित स्वास्थ्य जांच महत्वपूर्ण भूमिका निभाती है। यहाँ रक्तचाप की जाँच से लेकर मधुमेह की जाँच तक किया जाता है। स्वास्थ्य जांच में दाँतों एवं हड्डियों की जांच और उपचार किए जाते हैं। साथ ही ग्रामीण लोगों को बुनियादी चिकित्सा सुविधाएं और आवश्यक उपकरण प्रदान करके ट्रस्ट स्वस्थ गांव बनाने की पहल कर रहा है।',
    },
  ];

  const renderItem = ({item}) => (
    <Flex
      background={'#EFEFEF'}
      width={'100%'}
      height={'auto'}
      borderWidth={5}
      style={{gap: 10}}
      mt={4}>
      <Text
        color={'#F56A02'}
        fontSize={20}
        fontWeight={'bold'}
        width={'60%'}
        margin={'auto'}
        textAlign={'center'}>
        {item.title}
      </Text>
      <Image
        style={{resizeMode: 'cover', width: '100%'}}
        source={item.images}
      />
      <Flex width="90%" margin={'auto'} style={{gap: 10}} mt={-4}>
        <Text fontSize={16}>{item.h1}</Text>
        <Text fontSize={16}>{item.h2}</Text>
      </Flex>
    </Flex>
  );
  return (
    <Carousel
      loop
      width={width}
      // height={'auto '} // Adjust height as needed
      autoPlay={true}
      data={data}
      scrollAnimationDuration={3000} // Adjust animation duration as needed
      renderItem={renderItem}
    />
  );
};

export default Test;
